# Scraping Data from a real website + Pandas

In [5]:
# Import necessary libraries
from bs4 import BeautifulSoup # For parsing HTML content
import requests # For sending HTTP requests

In [7]:
# URL of the Wikipedia page that lists the largest U.S. companies by revenue
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

# Send an HTTP GET request to the URL and store the response
page = requests.get(url)

# Parse the HTML content of the page using BeautifulSoup
soup = BeautifulSoup(page.text, 'html')

In [39]:
# print(soup)

In [41]:
# soup.find_all('table')[0]

In [17]:
# Find all <table> elements on the page and select the first one,
# which contains the list of largest U.S. companies by revenue
table = soup.find_all('table')[0]

In [43]:
# print(table)

In [21]:
# Find all table header cells (<th>) within the selected table.
# These usually contain the column names like 'Company', 'Revenue', etc.
world_title = table.find_all('th')

In [23]:
# Extract the text from each <th> tag, remove leading/trailing whitespace,
# and store the cleaned column names in a list
world_table_titles = [title.text.strip() for title in world_title]

# Print the list of column headers
print(world_table_titles)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [25]:
# Import the pandas library for working with tabular data
import pandas as pd

In [27]:
# Create an empty DataFrame with column headers from the table (extracted earlier)
df = pd.DataFrame(columns = world_table_titles)

In [29]:
# Displaying the current state of the DataFrame
df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [31]:
# Find all table rows (<tr>) within the selected table.
column_data = table.find_all('tr')

In [33]:
# Loop through each row in the column_data, starting from the second row (skipping the header)
for row in column_data[1:]:
    row_data = row.find_all('td')
    individual_row_data = [data.text.strip() for data in row_data]

    # Get the current length of the DataFrame (number of rows)
    length = len(df)
    df.loc[length] = individual_row_data

In [35]:
df

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"648,125",6.0%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"574,785",11.9%,"1,525,000","Seattle, Washington"
2,3,Apple,Electronics industry,"383,482",-2.8%,"161,000","Cupertino, California"
3,4,UnitedHealth Group,Healthcare,"371,622",14.6%,"440,000","Minnetonka, Minnesota"
4,5,Berkshire Hathaway,Conglomerate,"364,482",20.7%,"396,500","Omaha, Nebraska"
...,...,...,...,...,...,...,...
95,96,TIAA,Financials,"45,735",11.8%,"16,023","New York City, New York"
96,97,CHS,Agriculture cooperative,"45,590",-4.6%,"10,609","Inver Grove Heights, Minnesota"
97,98,Bristol-Myers Squibb,Pharmaceutical industry,"45,006",-2.5%,"34,100","New York City, New York"
98,99,Dow Chemical Company,Chemical industry,"44,622",-21.6%,"35,900","Midland, Michigan"
99,100,Best Buy,Retail,"43,452",-6.1%,"85,000","Richfield, Minnesota"

In [37]:
# Save the DataFrame 'df' to a CSV file at the specified path
# 'index=False' ensures that the row indices are not written to the CSV file
df.to_csv(r'D:\Data Analyst Course\Python Projects\Companies.csv', index = False)